title: Audit Curl Execution
id: a49370b2-d0e3-469b-8fcc-25f084d8b047
status: experimental
description: Detects execution of curl command
author: WHS-Logrr
logsource:
  product: linux
  service: auditd
detection:
  selection:
    actor.process.name: "curl"
    actor.process.file.path: "/usr/bin/curl"
  condition: selection
fields:
  - actor.process.name
  - actor.process.cmd_line
  - user.name
level: high
tags:
  - attack.exfiltration
  - event_type.curl