title: CVE-2022-0847 DirtyPipe Failed su-to-root
id: 6C8F4F3A-7D0F-46B4-8C61-8E5B295E0E3F
status: stable
description: CVE-2022-0847 DirtyPipe Failed su-to-root
author: bsk2002, eoadkw, pandyo
date: 2025-07-29
tags:
  - attack.cve_2022_0847
  - event_type.cve_2022_0847

logsource:
  product: ocsf

detection:
  ids_event:
    class_uid: 5023

  syslog_msg:
    message|contains: FAILED

  syslog_msg2:
    message|contains: SU

  syslog_msg3:
    message|contains: root

  condition: ids_event and syslog_msg and syslog_msg2 and syslog_msg3

falsepositives:
  - The administrator entered the su command incorrectly.

level: high
