title: Curl files path
id: 55B19247-2197-4E3A-8DFD-85F3C15E9840
status: stable
description: Executes CURL command in files path.
author: eoadkw, pandyo, bsk2002
date: 2025-07-29
tags:
  - tool.curl
  - event_type.curl

logsource:
  product: ocsf

detection:
  sel_class:
    class_uid: 1007

  sel_wd:
    actor.process.working_directory: "/var/www/html/apache2/webapi/files"

  condition: sel_class and sel_wd

falsepositives:
  - Administrator's command

level: high
