title: Nginx Files Directory Access
id: 25e5f054-4dbd-4d2d-aa66-165678c9d69e
status: experimental
description: Detects access to /files/ directory
author: WHS-Logrr
logsource:
  product: nginx
  service: access
detection:
  selection:
    http_request.url.path: "*webapi/files/*"
  condition: selection
fields:
  - src_endpoint.ip
  - http_request.method
  - http_request.url.path
level: high
tags:
  - attack.collection
  - event_type.files