title: Nginx Write Post Request
id: 9e561566-16ff-458e-8081-a72627f5d764
status: experimental
description: Detects POST requests to write
author: WHS-Logrr
logsource:
  product: nginx
  service: access
detection:
  selection:
    http_request.http_method: "POST"
    http_request.url.path.keyword: "/webapi/board/write.php"
  condition: selection
fields:
  - src_endpoint.ip
  - http_request.method
  - http_request.url.path
level: high
tags:
  - attack.initial_access
  - event_type.write