title: CVE-2021-4034 Pkexec SUID Bit Set
id: 7E6AB25B-0C44-4F27-8847-8416A61B4E0D
status: stable
description: CVE-2021-4034 Pkexec SUID Bit Set
author: bsk2002, eoadkw, pandyo
date: 2025-07-29
tags:
  - attack.cve_2021_4034
  - event_type.cve_2021_4034

logsource:
  product: ocsf

detection:
  ids_event:
    class_uid: 5023

  pkexec_path:
    message.keyword|contains: "/usr/bin/pkexec"

  chmod_suid:
    message.keyword|contains: "chmod u+s"

  condition: ids_event and pkexec_path and chmod_suid

falsepositives:
  - Legitimate SUID settings by system administrators

level: high
