title: MySQL Restart via mysqld_safe (Potential CVE-2016-6662)
id: E47596A3-2F2A-4F62-9C23-1B784BEF40D4
status: stable
description: MySQL Restart via mysqld_safe (Potential CVE-2016-6662)
author: bsk2002, eoadkw, pandyo
date: 2025-07-29
tags:
  - attack.cve_2016_6662
  - event_type.mysql_restart

logsource:
  product: ocsf

detection:
  ids_event:
    class_uid: 5003

  sudo_prefix:
    message.keyword|contains: "sudo:"

  mysqld_safe_cmd:
    message.keyword|contains: "COMMAND=/usr/local/mysql/bin/mysqld_safe --user=mysql"

  condition: ids_event and sudo_prefix and mysqld_safe_cmd

falsepositives:
  - The recovery script restarts mysqld_safe

level: high