title: Sudo pkill mysqld (Potential CVE-2016-6662)
id: 1F4AD0CD-FE9A-4F45-9C8A-1B1430F8B37A
status: stable
description: Sudo pkill mysqld (Potential CVE-2016-6662)
author: bsk2002, eoadkw, pandyo
date: 2025-07-29
tags:
  - attack.cve_2016_6662
  - event_type.sudo_pkill_mysqld

logsource:
  product: ocsf

detection:
  syslog_event:
    class_uid: 5003

  sudo_prefix:
    message.keyword|contains: "sudo:"

  pkill_cmd:
    message.keyword|contains: "COMMAND=/usr/bin/pkill mysqld"

  condition: syslog_event and sudo_prefix and pkill_cmd

falsepositives:
  - Restarting MySQL during normal inspection and deployment process

level: high